fduignan/stm32l031_examples/ST7789/STM32L0x1.h
typedef struct {                                /*!< (@ 0x40021000) RCC Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) Clock control register                                     */
  __IOM uint32_t  ICSCR;                        /*!< (@ 0x00000004) Internal clock sources calibration register                */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CFGR;                         /*!< (@ 0x0000000C) Clock configuration register                               */
  __IM  uint32_t  CIER;                         /*!< (@ 0x00000010) Clock interrupt enable register                            */
  __IM  uint32_t  CIFR;                         /*!< (@ 0x00000014) Clock interrupt flag register                              */
  __IM  uint32_t  CICR;                         /*!< (@ 0x00000018) Clock interrupt clear register                             */
  __IOM uint32_t  IOPRSTR;                      /*!< (@ 0x0000001C) GPIO reset register                                        */
  __IOM uint32_t  AHBRSTR;                      /*!< (@ 0x00000020) AHB peripheral reset register                              */
  __IOM uint32_t  APB2RSTR;                     /*!< (@ 0x00000024) APB2 peripheral reset register                             */
  __IOM uint32_t  APB1RSTR;                     /*!< (@ 0x00000028) APB1 peripheral reset register                             */
  __IOM uint32_t  IOPENR;                       /*!< (@ 0x0000002C) GPIO clock enable register                                 */
  __IOM uint32_t  AHBENR;                       /*!< (@ 0x00000030) AHB peripheral clock enable register                       */
  __IOM uint32_t  APB2ENR;                      /*!< (@ 0x00000034) APB2 peripheral clock enable register                      */
  __IOM uint32_t  APB1ENR;                      /*!< (@ 0x00000038) APB1 peripheral clock enable register                      */
  __IOM uint32_t  IOPSMEN;                      /*!< (@ 0x0000003C) GPIO clock enable in sleep mode register                   */
  __IOM uint32_t  AHBSMENR;                     /*!< (@ 0x00000040) AHB peripheral clock enable in sleep mode register         */
  __IOM uint32_t  APB2SMENR;                    /*!< (@ 0x00000044) APB2 peripheral clock enable in sleep mode register        */
  __IOM uint32_t  APB1SMENR;                    /*!< (@ 0x00000048) APB1 peripheral clock enable in sleep mode register        */
  __IOM uint32_t  CCIPR;                        /*!< (@ 0x0000004C) Clock configuration register                               */
  __IOM uint32_t  CSR;                          /*!< (@ 0x00000050) Control and status register                                */
} RCC_Type;                                     /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                        SYSCFG_COMP                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller and COMP  register (SYSCFG_COMP)
  */

typedef struct {                                /*!< (@ 0x40010000) SYSCFG_COMP Structure                                      */
  __IOM uint32_t  CFGR1;                        /*!< (@ 0x00000000) SYSCFG configuration register 1                            */
  __IOM uint32_t  CFGR2;                        /*!< (@ 0x00000004) SYSCFG configuration register 2                            */
  __IOM uint32_t  EXTICR1;                      /*!< (@ 0x00000008) external interrupt configuration register 1                */
  __IOM uint32_t  EXTICR2;                      /*!< (@ 0x0000000C) external interrupt configuration register 2                */
  __IOM uint32_t  EXTICR3;                      /*!< (@ 0x00000010) external interrupt configuration register 3                */
  __IOM uint32_t  EXTICR4;                      /*!< (@ 0x00000014) external interrupt configuration register 4                */
  __IOM uint32_t  COMP1_CTRL;                   /*!< (@ 0x00000018) Comparator 1 control and status register                   */
  __IOM uint32_t  COMP2_CTRL;                   /*!< (@ 0x0000001C) Comparator 2 control and status register                   */
  __IOM uint32_t  CFGR3;                        /*!< (@ 0x00000020) SYSCFG configuration register 3                            */
} SYSCFG_COMP_Type;                             /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface (SPI1)
  */

typedef struct {                                /*!< (@ 0x40013000) SPI1 Structure                                             */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) control register 2                                         */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000008) status register                                            */
  __IOM uint32_t  DR;                           /*!< (@ 0x0000000C) data register                                              */
  __IOM uint32_t  CRCPR;                        /*!< (@ 0x00000010) CRC polynomial register                                    */
  __IM  uint32_t  RXCRCR;                       /*!< (@ 0x00000014) RX CRC register                                            */
  __IM  uint32_t  TXCRCR;                       /*!< (@ 0x00000018) TX CRC register                                            */
  __IOM uint32_t  I2SCFGR;                      /*!< (@ 0x0000001C) I2S configuration register                                 */
  __IOM uint32_t  I2SPR;                        /*!< (@ 0x00000020) I2S prescaler register                                     */
} SPI1_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter-integrated circuit (I2C1)
  */

